In [1]:
df1 = df.reindex(index=dates[0:4],colums=list(df.colums)+['E']) # 원하는것 선택 추가 삭제 변경 가능
df1.dropna(how='any') # any 디폴트 결측치 있는 값 삭제 행 삭제 axis =1  열삭제
df1.fillna(value=5) # 결측시 값 채우기 bfill ffill 앞 뒷 것으로 채우기

NameError: name 'df' is not defined

In [ ]:
pd.isna(df1) # nan = True로 표시

In [ ]:
###### 예제 코드 1
import numpy as np
import pandas as pd
# 다음의 데이터들을 하나의 Data Frame으로 만들고 (index는 labels) 시험 응시한 회수가 2회 미만이면서 성적이 15점 이상인 행을 선택하고, 또한 응시한 회수가 2회 이상이면서 성적이 10점 미만인 행을 선택해서 출력하시오.

In [7]:
exam_data = {
    '이름': ['정수현', '윤웅익', '우성호', '김복희', '홍길동', '임꺽정', '이창신', '김완', '최영규', '한범석'],
    '점수': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    '응시횟수': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    '합격여부': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
}

In [6]:
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [14]:
df = pd.DataFrame(exam_data, index=labels)

In [15]:
df

    이름    점수  응시횟수 합격여부
a  정수현  12.5     1  yes
b  윤웅익   9.0     3   no
c  우성호  16.5     2  yes
d  김복희   NaN     3   no
e  홍길동   9.0     2   no
f  임꺽정  20.0     3  yes
g  이창신  14.5     1  yes
h   김완   NaN     1   no
i  최영규   8.0     2   no
j  한범석  19.0     1  yes

In [20]:
df[(df['응시횟수'] < 2) & (df['점수']>= 15)]

    이름    점수  응시횟수 합격여부
j  한범석  19.0     1  yes

In [22]:
df[(df['응시횟수'] >= 2) & (df['점수'] < 10)]

    이름   점수  응시횟수 합격여부
b  윤웅익  9.0     3   no
e  홍길동  9.0     2   no
i  최영규  8.0     2   no

In [ ]:
# 문제 1과 같은 데이터셋에서 ‘점수’에 Missing data인 NaN 값을 평균값(mean) 값으로 변경하는 코드를 작성 하시오.

In [25]:
df['점수'].fillna(df['점수'].mean(), inplace=True)

In [26]:
df

    이름       점수  응시횟수 합격여부
a  정수현  12.5000     1  yes
b  윤웅익   9.0000     3   no
c  우성호  16.5000     2  yes
d  김복희  13.5625     3   no
e  홍길동   9.0000     2   no
f  임꺽정  20.0000     3  yes
g  이창신  14.5000     1  yes
h   김완  13.5625     1   no
i  최영규   8.0000     2   no
j  한범석  19.0000     1  yes